In [51]:
import pandas as pd

In [52]:
data = pd.read_excel(r'F:\study\Conestoga\Big Data Solution Architecture\Programming for Big Data\Assignments\ASSIGNMENT-4_&_5-OK\ASSIGNMENT-4_&_5-OK\CC-3Y-Transactions.xlsx')

In [53]:
data['year']=data['Date'].dt.year

In [54]:
data_2013=(data.loc[data['year'].eq(2013)]\
        .groupby('City')['Amount'].agg('sum')\
        .reset_index(name='Total_Expense'))

In [55]:
topcity_2013=(data_2013.nlargest(5,['Total_Expense']))
topcity_2013=topcity_2013.sort_values(['Total_Expense'],ascending=False)
y=list(map(str,topcity_2013['Total_Expense'].tolist()))
pd.DataFrame([y],index=['2013'],columns=topcity_2013['City'])

City,"Bengaluru, India","Greater Mumbai, India","Ahmedabad, India","Delhi, India","Kanpur, India"
2013,84999287,84735652,83291837,82126961,19640338

In [56]:
topcity_2014=(data.loc[data['year'].eq(2014)]\
        .groupby('City')['Amount'].agg('sum')\
        .reset_index(name='Total_Expense'))

In [57]:
topcity_2014=(topcity_2014.nlargest(5,['Total_Expense']))
topcity_2014=topcity_2014.sort_values(['Total_Expense'],ascending=False)
y=list(map(str,topcity_2014['Total_Expense'].tolist()))
pd.DataFrame([y],index=['2014'],columns=topcity_2014['City'])

City,"Bengaluru, India","Greater Mumbai, India","Ahmedabad, India","Delhi, India","Hyderabad, India"
2014,351482095,349709415,348289187,329591186,71066005

In [58]:
topcity_2015=(data.loc[data['year'].eq(2015)]\
        .groupby('City')['Amount'].agg('sum')\
        .reset_index(name='Total_Expense'))

In [59]:
topcity_2015=(topcity_2015.nlargest(5,['Total_Expense']))
topcity_2015=topcity_2015.sort_values(['Total_Expense'],ascending=False)
y=list(map(str,topcity_2015['Total_Expense'].tolist()))
pd.DataFrame([y],index=['2015'],columns=topcity_2015['City'])

City,"Delhi, India","Greater Mumbai, India","Ahmedabad, India","Bengaluru, India","Kolkata, India"
2015,145211065,142306409,136213286,135845357,30918731

In [60]:
data['MM']=pd.DatetimeIndex(data['Date']).month
def func(x):
    if x<=3: 
        return "Quarter1"
    elif x<=6:
        return "Quarter2"
    elif x<=9:
        return "Quarter3"
    else: 
        return "Quarter4"

data['quarter']=data['MM'].apply(func)

In [61]:
filter = (data['year'] == 2013)
data[filter].head(5)
data2013 = data[filter].groupby(['year','Gender','quarter'])['Amount'].sum()
data2013

year  Gender  quarter
2013  F       Quarter4    333421908
      M       Quarter4    280221976
Name: Amount, dtype: int64

In [62]:
filter = (data['year'] == 2014)
data[filter].head(5)
data2014 = data[filter].groupby(['year','Gender','quarter'])['Amount'].sum()
data2014

year  Gender  quarter
2014  F       Quarter1    318768288
              Quarter2    331421060
              Quarter3    335382914
              Quarter4    334689993
      M       Quarter1    281336181
              Quarter2    269947023
              Quarter3    290613061
              Quarter4    292555513
Name: Amount, dtype: int64

In [63]:
filter = (data['year'] == 2015)
data[filter].head(5)
data2015 = data[filter].groupby(['year','Gender','quarter'])['Amount'].sum()
data2015

year  Gender  quarter
2015  F       Quarter1    344993188
              Quarter2    206633679
      M       Quarter1    279678969
              Quarter2    175169620
Name: Amount, dtype: int64

In [64]:
data_2013=(data.loc[data['year'].eq(2013)]\
        .groupby('Exp Type')['Amount'].agg('sum')\
        .reset_index(name='Total_Expense'))

In [71]:
topExpenseType_2013=(data_2013.nlargest(3,['Total_Expense']))
topExpenseType_2013=topExpenseType_2013.sort_values(['Total_Expense'],ascending=True)
y=list(map(str,topExpenseType_2013['Total_Expense'].tolist()))
pd.DataFrame([y],index=['2013'],columns=topExpenseType_2013['Exp Type'])

Exp Type       Fuel       Food      Bills
2013      113938738  123284967  136165014

In [72]:
data_2014=(data.loc[data['year'].eq(2014)]\
        .groupby('Exp Type')['Amount'].agg('sum')\
        .reset_index(name='Total_Expense'))

In [73]:
topExpeseType_2014=(data_2014.nlargest(3,['Total_Expense']))
topExpeseType_2014=topExpeseType_2014.sort_values(['Total_Expense'],ascending=True)
y=list(map(str,topExpeseType_2014['Total_Expense'].tolist()))
pd.DataFrame([y],index=['2014'],columns=topExpeseType_2014['Exp Type'])

Exp Type       Fuel       Food      Bills
2014      481697184  491383057  543741413

In [74]:
data_2015=(data.loc[data['year'].eq(2015)]\
        .groupby('Exp Type')['Amount'].agg('sum')\
        .reset_index(name='Total_Expense'))

In [75]:
topExpeseType_2015=(data_2015.nlargest(3,['Total_Expense']))
topExpeseType_2015=topExpeseType_2015.sort_values(['Total_Expense'],ascending=True)
y=list(map(str,topExpeseType_2015['Total_Expense'].tolist()))
pd.DataFrame([y],index=['2015'],columns=topExpeseType_2015['Exp Type'])

Exp Type       Fuel       Food      Bills
2015      193499899  210055985  227166046